In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('synthetic_salary_dataset.csv')

In [3]:
data.head(5)

,Position,YearsExperience,EducationLevel,Industry,Location,Salary(INR)
0,NLP Engineer,2.8,PhD,Finance,Mumbai,1288000.0
1,Machine Learning Engineer,12.3,Bachelors,Finance,Bangalore,1488000.0
2,Computer Vision Engineer,4.8,Bachelors,Manufacturing,Remote,897000.0
3,Machine Learning Engineer,1.7,Bachelors,IT,Delhi,676000.0
4,MLOps Engineer,12.4,Masters,Healthcare,Chennai,2416000.0

In [5]:
data.shape

(500, 6)

In [6]:
data.isnull().sum()

Position           0
YearsExperience    0
EducationLevel     0
Industry           0
Location           0
Salary(INR)        0
dtype: int64

In [7]:
data.columns

Index(['Position', 'YearsExperience', 'EducationLevel', 'Industry', 'Location',
       'Salary(INR)'],
      dtype='object')

In [12]:
data[['Position','YearsExperience','Salary(INR)']].sort_values(by='Salary(INR)',ascending=False).head(5)

                          Position  YearsExperience  Salary(INR)
352      Machine Learning Engineer             13.3    2821000.0
50                    NLP Engineer             14.7    2808000.0
8                   Data Scientist             14.9    2803000.0
69   Business Intelligence Analyst             14.9    2791000.0
479                 Data Scientist             13.6    2737000.0

In [14]:
data['Position'].value_counts()

Position
Computer Vision Engineer         62
Business Intelligence Analyst    60
Data Scientist                   56
MLOps Engineer                   50
Software Engineer                48
Data Analyst                     48
AI Researcher                    47
Machine Learning Engineer        47
NLP Engineer                     44
Big Data Engineer                38
Name: count, dtype: int64

In [15]:
import numpy as np

In [21]:
data.groupby('Position')['Salary(INR)'].sum().sort_values(ascending=False).head(5)

Position
Computer Vision Engineer         97626000
Business Intelligence Analyst    90126000
Data Scientist                   80954000
Machine Learning Engineer        76855000
Data Analyst                     75541000
Name: Salary(INR), dtype: int64

In [20]:
data['Salary(INR)'] = data['Salary(INR)'].astype('int64')